In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('titanic.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
df[df['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [7]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [8]:
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])
df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [9]:
df.iloc[[5,6,17, 19, 45, 95,96,97,98,99,100]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,S.C./A.4. 23567,8.0500,NaN,S
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,8.0500,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.0,0,1,PC 17759,63.3583,D10 D12,C
98,99,1,2,"Doling, Mrs. John T (Ada Julia Bone)",female,34.0,0,1,231919,23.0000,NaN,S
99,100,0,2,"Kantor, Mr. Sinai",male,34.0,1,0,244367,26.0000,NaN,S
100,101,0,3,"Petranec, Miss. Matilda",female,28.0,0,0,349245,7.8958,NaN,S

In [10]:
print(df['Pclass'].unique())

[3 1 2]

In [11]:
print(df['Sex'].unique())

['male' 'female']

In [12]:
df.groupby(['Pclass', 'Sex', 'SibSp'])['Age'].describe()

                     count       mean        std    min      25%   50%    75%  \
Pclass Sex    SibSp
1      female 0       46.0  34.000000  13.016229  15.00  24.0000  31.5  42.75
              1       34.0  36.441176  14.315051   2.00  26.5000  37.0  47.75
              2        3.0  30.666667  19.399313  18.00  19.5000  21.0  37.00
              3        2.0  23.500000   0.707107  23.00  23.2500  23.5  23.75
       male   0       67.0  42.738806  15.062335   4.00  31.5000  40.0  54.50
              1       31.0  38.481290  15.255322   0.92  28.5000  38.0  49.00
              2        2.0  47.000000   4.242641  44.00  45.5000  47.0  48.50
              3        1.0  19.000000        NaN  19.00  19.0000  19.0  19.00
2      female 0       42.0  30.440476  12.468596   6.00  23.2500  30.0  37.50
              1       28.0  27.321429  13.452395   2.00  22.0000  27.5  34.50
              2        3.0  17.333333  11.547005   4.00  14.0000  24.0  24.00
              3        1.0  30.000000        NaN  30.00  30.0000  30.0  30.00
       male   0       67.0  32.870597  14.098161   0.83  23.5000  30.0  39.00
              1       27.0  27.407407  15.980645   0.67  20.0000  31.0  35.00
              2        5.0  20.200000  11.519549   1.00  21.0000  23.0  24.00
3      female 0       56.0  22.866071  11.546149   1.00  17.7500  22.0  28.25
              1       28.0  27.232143  12.637014   1.00  18.7500  28.5  36.50
              2        6.0   9.083333   8.684277   0.75   1.8125   7.0  15.75
              3        5.0  11.000000  12.668859   2.00   3.0000   8.0   9.00
              4        6.0   8.333333   5.278889   2.00   5.2500   7.5  10.50
              5        1.0  16.000000        NaN  16.00  16.0000  16.0  16.00
              8        0.0        NaN        NaN    NaN      NaN   NaN    NaN
       male   0      193.0  29.012539  11.141557   0.42  21.0000  27.0  34.00
              1       35.0  23.057143  10.189218   1.00  17.0000  25.0  29.50
              2        6.0  28.666667   9.070097  16.00  24.5000  27.0  34.75
              3        3.0   5.333333   4.163332   2.00   3.0000   4.0   7.00
              4       12.0   6.416667   4.776045   1.00   2.7500   5.5   8.25
              5        4.0   8.750000   5.560276   1.00   7.0000  10.0  11.75
              8        0.0        NaN        NaN    NaN      NaN   NaN    NaN

                      max
Pclass Sex    SibSp
1      female 0      62.0
              1      63.0
              2      53.0
              3      24.0
       male   0      80.0
              1      70.0
              2      50.0
              3      19.0
2      female 0      57.0
              1      54.0
              2      24.0
              3      30.0
       male   0      70.0
              1      60.0
              2      32.0
3      female 0      63.0
              1      48.0
              2      21.0
              3      33.0
              4      17.0
              5      16.0
              8       NaN
       male   0      74.0
              1      40.0
              2      41.0
              3      10.0
              4      16.0
              5      14.0
              8       NaN

In [13]:
df['Age'] = df.groupby(['Pclass', 'Sex'])['Age'].transform(lambda x: x.fillna(x.median()))

In [14]:
df.head(25)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,25.0,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,30.0,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,21.5,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S